{
  "bio": {
    "firstName": "Carlito",
    "lastName": "Cubilla",
    "email": {
      "work": "carlito.t.cubilla@verizon.com",
      "personal": "carlito.cubilla@gmail.com"
    },
    "phone": {
      "personal": "1.416.553.9449"
    },
    "summary": "Richard hails from Tulsa. He has earned degrees from the University of Oklahoma and Stanford. (Go Sooners and Cardinals!) Before starting Pied Piper, he worked for Hooli as a part time software developer. While his work focuses on applied information theory, mostly optimizing lossless compression schema of both the length-limited and adaptive variants, his non-work interests range widely, everything from quantum computing to chaos theory. He could tell you about it, but THAT would NOT be a “length-limited” conversation!",
    "location": {
      "city": "Brampton",
      "countryCode": "CA",
      "state": "ON"
    },
    "profiles": {
    	"facebook": "zuck",
    	"github": "carlitocubilla",
    	"twitter": "carlcubilla",
    	"linkedin": "carlcubilla",
    	"pinterest": "carlitocubilla",
    	"googleplus": "+sitepoint",
    	"youtube": "thenewboston",
    	"behance": "grapheine",
    	"vimeo": "user1577007",
    	"flickr": "foxglove",
    	"codepen": "JaredCubilla"
    }
  },
  "work": [
    {
      "company": "Verizon Enterprise Solutions (Canada)",
      "position": "Technical Program Manager",
      "website": "http://www.verizonenterprise.com/",
      "startDate": "2011-06",
      "summary": "Act as customer advocate responsible for ensuring, maintaining and enhancing the performance of customer global networks to deliver customer satisfaction and generate potential revenue. Ensures all agreed Service Levels are being delivered. Responsible for the submission of SLA reports. Serves as a consultant to customer to continually drive optimization, stability and durability of the customer's network while working closely with the appropriate internal organizations. Partners with the customer account team to develop and manage network and service plans. ",
      "highlights": [
        "Works with the global account team to drive the delivery of contracted SLAs, measurement of key performance metrics and prioritization of improvement on Incident, Problem, Change, Availability and Service Level Management processes. Manages relationship with global clients and stakeholders by gathering requirements, managing projects, providing policies/processes, and measuring support frameworks that follow the business strategic objectives. Acts as an advocate and as a single point-of-contact between the customer and Verizon.",
        "Provides hands-on leadership during high-priority, critical incidents ensuring timely resolution, appropriate follow-up, and relevant communications to stakeholders. Assesses client’s satisfaction with services, identifies opportunities for change, improvement and makes recommendations to senior management. Monitors the delivery of services against pre-specified standards and service level objectives. Presents meaningful information and performance reports that are tied to business KPI’s. Works with third-party vendors and suppliers in resolving SLA and other service deliverable disputes.",
		"Interacts with Project Sponsors, other TPM’s, and internal SME’s to define and deliver cross-geographical projects and programs. Comprehensive knowledge in IT Service Management, Enterprise Networking and Telecommunications, including related concepts, technologies, best practices, reporting, and tools."
      ]
    },
    {
    	"company": "Verizon Canada Ltd.",
    	"position": "Telecom Specialist",
    	"startDate": "2010-06",
    	"endDate": "2011-06",
    	"summary": "Provided external client facing IT support services for all telecommunications (MPLS, Metro Ethernet, Frame Relay and ATM) and Internet services in Canada and in the Asia Pacific region (wholesale/retail voice customers). Interact with customer service and network management centers, operations groups, LECs, account teams and customers to facilitate isolation and repair of services within the established SLA’s .",
    	"highlights": [
    		"Provided external client facing IT support services for all telecommunication and Internet services in Canada and wholesale/retail voice services in the Asia Pacific region. Performed remote end-to-end trouble management on Verizon’s network; interacted with customer service, network management centres, Verizon operations group, LECs/PTTs, account teams and customers to facilitate isolation and repair services within established SLAs. Oversaw incidents, routed to support specialist groups when needed; implemented correct prioritization, classification and initial support; monitored status and progress towards resolution."
    	]
    },
    {
    	"company": "Barclay's Capital Services LTD.",
    	"position": "Network Analyst",
    	"startDate": "2008-11",
    	"endDate": "2010-06",
    	"summary": "Provided technical support for Asia Pacific “Managed” customers and selected customers in the US, Latin America and EMEA. Worked with Asia Pacific tiered-local carrier partners in handling and managing fault or incidents. Facilitated gathering data and prepared investigative summary and incident report.",
    	"highlights": []
    },
    {
    	"company": "Barclay's Capital Services LTD.",
    	"position": "Network Analyst",
    	"startDate": "2008-11",
    	"endDate": "2010-06",
    	"summary": "Provided technical support for Asia Pacific “Managed” customers and selected customers in the US, Latin America and EMEA. Worked with Asia Pacific tiered-local carrier partners in handling and managing fault or incidents. Facilitated gathering data and prepared investigative summary and incident report."
    },
    {
    	"company": "Barclay's Capital Services LTD.",
    	"position": "Network Analyst",
    	"startDate": "2008-11",
    	"endDate": "2010-06",
    	"summary": "Provided technical support for Asia Pacific “Managed” customers and selected customers in the US, Latin America and EMEA. Worked with Asia Pacific tiered-local carrier partners in handling and managing fault or incidents. Facilitated gathering data and prepared investigative summary and incident report."
    }
  ],
  "education": [
    {
      "institution": "The University of British Columbia",
      "startDate": "2014",
      "endDate": "2016",
      "area": "Business Analysis",
      "studyType": "Certificate"
    },
    {
      "institution": "Central Colleges of the Philippines",
      "startDate": "1990",
      "endDate": "1995",
      "area": "Computer Engineering",
      "studyType": "Bachelor"
    }
  ],
  "awards": [
    {
      "title": "Customer Service Week Award",
      "date": "2014",
      "awarder": "Verizon"
    },
    {
      "title": " Verizon Ovation Award",
      "date": "2012"
    }
  ],
  "skills": [
    {
      "name": "ITSM",
      "level": "Master",
      "keywords": [
        "ITIL",
        "Service Management"
      ]
    }
  ],
  "references": [
    {
      "name": "Keith Heider",
      "reference": "Carlito is a dedicated resource who produces work that far surpasses the expectations given him. During his time with the ITIL Best Practice program he produced a best in class metrics document that is expandable and sustainable. We have used Carlito's metrics manual for several subsequent IT Capability Methods and Procedures manuals."
    }
  ]
}